In [47]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame
# Seies為處理一維陣列的函式庫、DataFrame為處理二維陣列的函式庫

In [5]:
sample_pandas_data = pd.Series([0,10,20,30,40,50,60,70,80,90])
print('index value')
print(sample_pandas_data)

index value
0     0
1    10
2    20
3    30
4    40
5    50
6    60
7    70
8    80
9    90
dtype: int64

In [6]:
sample_pandas_index_data = pd.Series([0,10,20,30,40,50,60,70,80,90],index = ['a','b','c','d','e','f','g','h','i','j'])
print(sample_pandas_index_data)

a     0
b    10
c    20
d    30
e    40
f    50
g    60
h    70
i    80
j    90
dtype: int64

In [8]:
print('資料之值',sample_pandas_index_data.values)
print('索引之值',sample_pandas_index_data.index)

資料之值 [ 0 10 20 30 40 50 60 70 80 90]
索引之值 Index(['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j'], dtype='object')

##### 2-4-3 DataFrame的使用方法

In [13]:
attri_data1 = {'ID':['100','101','102','103','104'],
               'City':['Tokyo','Osaka','Kyoto','Hokkaido','Tokyo'],
               'Birth_year':[1990,1989,1992,1997,1982],
               'Name':['Hiroshi','Akiko','Yuki','Satoru','Steve']}

attri_data_frame1 = DataFrame(attri_data1)
print(attri_data_frame1)

    ID      City  Birth_year     Name
0  100     Tokyo        1990  Hiroshi
1  101     Osaka        1989    Akiko
2  102     Kyoto        1992     Yuki
3  103  Hokkaido        1997   Satoru
4  104     Tokyo        1982    Steve

In [14]:
# index換為abcde
attri_data_index1 = DataFrame(attri_data1,index = ['a','b','c','d','e'])
print(attri_data_index1)

    ID      City  Birth_year     Name
a  100     Tokyo        1990  Hiroshi
b  101     Osaka        1989    Akiko
c  102     Kyoto        1992     Yuki
d  103  Hokkaido        1997   Satoru
e  104     Tokyo        1982    Steve

In [17]:
attri_data_index1

    ID      City  Birth_year     Name
a  100     Tokyo        1990  Hiroshi
b  101     Osaka        1989    Akiko
c  102     Kyoto        1992     Yuki
d  103  Hokkaido        1997   Satoru
e  104     Tokyo        1982    Steve

#### 2-4-4 行列的操作

In [21]:
# 轉置
attri_data_frame1.T

                  0      1      2         3      4
ID              100    101    102       103    104
City          Tokyo  Osaka  Kyoto  Hokkaido  Tokyo
Birth_year     1990   1989   1992      1997   1982
Name        Hiroshi  Akiko   Yuki    Satoru  Steve

#### 2-4-5 資料的抽出

In [22]:
# 指定行名（1個的情況）
attri_data_frame1.Birth_year

0    1990
1    1989
2    1992
3    1997
4    1982
Name: Birth_year, dtype: int64

In [23]:
# 指定行名（多個的情況）
attri_data_frame1[['ID','Birth_year']]

    ID  Birth_year
0  100        1990
1  101        1989
2  102        1992
3  103        1997
4  104        1982

In [24]:
# 條件（過濾器）
attri_data_frame1[ttri_data_frame1['City'] == 'Tokyo']

    ID   City  Birth_year     Name
0  100  Tokyo        1990  Hiroshi
4  104  Tokyo        1982    Steve

In [26]:
# 條件（過濾器、多個值）
attri_data_frame1[attri_data_frame1['City'].isin(['Tokyo','Osaka'])]

    ID   City  Birth_year     Name
0  100  Tokyo        1990  Hiroshi
1  101  Osaka        1989    Akiko
4  104  Tokyo        1982    Steve

#### 2-4-6 資料的刪除與結合

In [27]:
# 用drop刪除Birth_year
attri_data_frame1.drop(['Birth_year'],axis=1)

    ID      City     Name
0  100     Tokyo  Hiroshi
1  101     Osaka    Akiko
2  102     Kyoto     Yuki
3  103  Hokkaido   Satoru
4  104     Tokyo    Steve

In [30]:
attri_data2 = {'ID':['100','101','102','103','104'],
               'Math':[50,43,33,76,98],
               'English':[90,30,20,50,30],
               'Sex':['M','F','F','M','M']}

attri_data_frame2 = DataFrame(attri_data2)
attri_data_frame2

    ID  Math  English Sex
0  100    50       90   M
1  101    43       30   F
2  102    33       20   F
3  103    76       50   M
4  104    98       30   M

In [31]:
# 資料的合併（內部結合，詳見第6章說明）
pd.merge(attri_data_frame1,attri_data_frame2)

    ID      City  Birth_year     Name  Math  English Sex
0  100     Tokyo        1990  Hiroshi    50       90   M
1  101     Osaka        1989    Akiko    43       30   F
2  102     Kyoto        1992     Yuki    33       20   F
3  103  Hokkaido        1997   Satoru    76       50   M
4  104     Tokyo        1982    Steve    98       30   M

#### 2-4-7 統計

In [38]:
# 資料的群別統計（詳見下一張說明）挑Sex出來做為分類將Math做平均數、最大值、最小值
print(attri_data_frame2.groupby('Sex')['Math'].mean())
print(attri_data_frame2.groupby('Sex')['Math'].max())
print(attri_data_frame2.groupby('Sex')['Math'].min())

Sex
F    38.000000
M    74.666667
Name: Math, dtype: float64
Sex
F    43
M    98
Name: Math, dtype: int64
Sex
F    33
M    50
Name: Math, dtype: int64

#### 2-4-8 值的排序

In [42]:
# 準備資料
attri_data2 = {'ID':['100','101','102','103','104'],
               'City':['Tokyo','Osaka','Kyoto','Hokkaido','Tokyo'],
               'Birth_year':[1990,1989,1992,1997,1982],
               'Name':['Hiroshi','Akiko','Yuki','Satoru','Steve']}

attri_data_feame2 = DataFrame(attri_data2) # 轉成DataFrame
attri_data_frame_index2 = DataFrame(attri_data2,index=['e','b','a','d','c'])
attri_data_frame_index2

    ID      City  Birth_year     Name
e  100     Tokyo        1990  Hiroshi
b  101     Osaka        1989    Akiko
a  102     Kyoto        1992     Yuki
d  103  Hokkaido        1997   Satoru
c  104     Tokyo        1982    Steve

In [43]:
# 基於index的排序
attri_data_frame_index2.sort_index()

    ID      City  Birth_year     Name
a  102     Kyoto        1992     Yuki
b  101     Osaka        1989    Akiko
c  104     Tokyo        1982    Steve
d  103  Hokkaido        1997   Satoru
e  100     Tokyo        1990  Hiroshi

In [44]:
# 基於值的排序，預設為從小到大
attri_data_frame_index2.Birth_year.sort_values ()

c    1982
b    1989
e    1990
a    1992
d    1997
Name: Birth_year, dtype: int64

#### 2-4-9 nan(null)的判斷

In [45]:
# 確認是否存在該值
attri_data_frame_index2.isin(['Tokyo'])

      ID   City  Birth_year   Name
e  False   True       False  False
b  False  False       False  False
a  False  False       False  False
d  False  False       False  False
c  False   True       False  False

In [48]:
# 將Name全設為nan
attri_data_frame_index2['Name'] = np.nan
# 判斷是否為nan
attri_data_frame_index2.isnull()

      ID   City  Birth_year  Name
e  False  False       False  True
b  False  False       False  True
a  False  False       False  True
d  False  False       False  True
c  False  False       False  True

In [49]:
# 判斷是否為null，統計
attri_data_frame_index2.isnull().sum()

ID            0
City          0
Birth_year    0
Name          5
dtype: int64

##### 練習問題2-7

In [69]:
# 請找出Money為500以上的人，並顯示紀錄。
from pandas import Series, DataFrame
import pandas as pd

attri_data1 = {'ID':['1','2','3','4','5'],
               'Sex':['F','F','M','M','F'],
               'Money':[1000,2000,500,300,700],
               'Name':['Saito','Horie','Kondo','Kawada','Matsubara']}
attri_data_frame1 = DataFrame(attri_data1)
attri_data_frame1[attri_data_frame1['Money'] > 500]

  ID Sex  Money       Name
0  1   F   1000      Saito
1  2   F   2000      Horie
4  5   F    700  Matsubara

##### 練習問題2-8

In [71]:
# 對於練習問題2-7的資料，請分別計算男女（MF分開看）的平均Money
attri_data_frame1.groupby('Sex')['Money'].mean()

Sex
F    1233.333333
M     400.000000
Name: Money, dtype: float64

##### 練習問題2-9

In [93]:
# 將練習題目2-7與下方資料以相同ID的人做為建來結合，接著請計算Money、Math和Engilsh的平均
attri_data2 = {'ID':['3','4','7'],
               'Math':[60,30,40],
               'English':[80,20,30]}
attri_data_frame2 = DataFrame(attri_data2)

attri_data_frame3 = pd.merge(attri_data_frame1,attri_data_frame2)
print(attri_data_frame3)
attri_data_frame3.mean()

  ID Sex  Money    Name  Math  English
0  3   M    500   Kondo    60       80
1  4   M    300  Kawada    30       20

/var/folders/gr/wkmgmg2d0w7dft51ggc120900000gn/T/ipykernel_24096/4118741810.py:9: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  attri_data_frame3.mean()

ID          17.0
Money      400.0
Math        45.0
English     50.0
dtype: float64